app/controllers/home_controller.rb

  def main
    @match = Match.find_by(id: params[:id])
---
SELECT  "matches".* FROM "matches" WHERE "matches"."id" IS NULL LIMIT ?  [["LIMIT", 1]]

  def show
    @match = Match.find_by(id: params[:id])
---
SELECT  "matches".* FROM "matches" WHERE "matches"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def index
    @matches = Match.all
---
SELECT "matches".* FROM "matches"

  def create
    @match = Match.new(Ateam: params[:Ateam] ,Bteam: params[:Bteam])
    @match.save
---
INSERT INTO "matches" ("Ateam", "Bteam", "created_at", "updated_at", "Acolor", "Bcolor") VALUES (?, ?, ?, ?, ?, ?)  [["Ateam", "Liverpool"], ["Bteam", "Leeds"], ["created_at", "2020-09-14 09:45:47.402087"], ["updated_at", "2020-09-14 09:45:47.402087"], ["Acolor", "#e30d0d"], ["Bcolor", "#faf9f9"]]